[{"data":1,"prerenderedAt":-1},["Reactive",2],{"content-query-JkF68eOZpz":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"_empty":6,"title":7,"description":5,"body":8,"_type":88,"_id":89,"_source":90,"_file":91,"_extension":92},"/research","",false,"Research",{"type":9,"children":10,"toc":85},"root",[11,18,45,50,55,68],{"type":12,"tag":13,"props":14,"children":17},"element","markdown-header",{"subtitle":15,"title":16},"📢 NEW: one paper accepted to HotMobile'23!","Research Statement",[],{"type":12,"tag":19,"props":20,"children":21},"p",{},[22,25,34,36,43],{"type":23,"value":24},"text","I'm a computer science Ph.D. candidate at ",{"type":12,"tag":26,"props":27,"children":31},"a",{"href":28,"rel":29},"https://wpi.edu",[30],"nofollow",[32],{"type":23,"value":33},"Worcester Polytechnic Institute",{"type":23,"value":35}," and a member of ",{"type":12,"tag":26,"props":37,"children":40},{"href":38,"rel":39},"https://cake.wpi.edu",[30],[41],{"type":23,"value":42},"TheCakeLab",{"type":23,"value":44},".\nMy research interest lies in designing mobile augmented reality (AR) systems and algorithms. My recent research has a strong focus on improving mobile AR lighting estimation to enable photorealistic AR experiences. In the past, I’ve designed algorithms (HotMobile’20, ECCV’20) and edge-assisted real-time systems (IMWUT’22, IEEEVRW’22, MobiSys’21, HotMobile’22) for mobile AR environment lighting estimation. I’m also interested in security issues associated with photorealism in AR (ACM MM’22). I’m fortunate to have conducted my research works in these areas under the guidance of Prof. Tian Guo alongside many wonderful collaborators, and I’m passionate to continue studying these problems in my Ph.D.",{"type":12,"tag":19,"props":46,"children":47},{},[48],{"type":23,"value":49},"Designing mobile systems for sensing environments has been a long-standing research topic. In recent years, emerging AR applications raise new standards for environment sensing on mobile devices in favor of the pursuit of photorealism. Lighting estimation, a task that aims to estimate omnidirectional lighting from limited environment observations, is at the key position of pursuing photorealistic and visually coherent rendering in AR. Traditionally, high-quality environment lighting is acquired using physical devices like light probes or 360° cameras. But such devices are often practically inaccessible to mobile devices and daily AR applications users.",{"type":12,"tag":19,"props":51,"children":52},{},[53],{"type":23,"value":54},"On a different vein, learning-based lighting estimation models have been adopted by the majority of AR frameworks in favor of their abilities to estimate environment lighting from single or multiple camera images. However, in complex real-world scenarios, such models often fail to adapt, as estimating 360° environment lighting from a low FoV camera image is a highly unconstrained task. My past research works on lighting estimation are focused on leveraging multi-sensor and temporal data to improve the estimation accuracy.",{"type":12,"tag":19,"props":56,"children":57},{},[58,60,66],{"type":23,"value":59},"Check out my research project details ",{"type":12,"tag":26,"props":61,"children":63},{"href":62},"/project/",[64],{"type":23,"value":65},"here",{"type":23,"value":67},".",{"type":12,"tag":19,"props":69,"children":70},{},[71],{"type":12,"tag":72,"props":73,"children":74},"em",{},[75,77,83],{"type":23,"value":76},"I'm generally interested in developing novel systems for future AR and HCI. If you are in interested in collaboration, ",{"type":12,"tag":26,"props":78,"children":80},{"href":79},"mailto:yzhao11@wpi.edu",[81],{"type":23,"value":82},"shoot me an email",{"type":23,"value":84},"!",{"title":5,"searchDepth":86,"depth":86,"links":87},2,[],"markdown","content:research.md","content","research.md","md"]