[{"data":1,"prerenderedAt":92},["Reactive",2],{"content-query-JkF68eOZpz":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":5,"body":8,"_type":87,"_id":88,"_source":89,"_file":90,"_extension":91},"/research","",false,"Research",{"type":9,"children":10,"toc":84},"root",[11,17,44,49,54,67],{"type":12,"tag":13,"props":14,"children":16},"element","MarkdownHeader",{"title":15},"Research Statement",[],{"type":12,"tag":18,"props":19,"children":20},"p",{},[21,24,33,35,42],{"type":22,"value":23},"text","I'm a computer science Ph.D. candidate at ",{"type":12,"tag":25,"props":26,"children":30},"a",{"href":27,"rel":28},"https://wpi.edu",[29],"nofollow",[31],{"type":22,"value":32},"Worcester Polytechnic Institute",{"type":22,"value":34}," and a member of ",{"type":12,"tag":25,"props":36,"children":39},{"href":37,"rel":38},"https://cake.wpi.edu",[29],[40],{"type":22,"value":41},"TheCakeLab",{"type":22,"value":43},".\nMy research interest lies in ubiquitous computing, augmented reality, and computer vision.\nMy recent research projects have a strong focus on improving photorealism in mobile AR by developing novel environment lighting sensing systems.\nThe insights of my research are mainly derived from the investigation of mobile device dynamics, physical modeling of spatial transformations, and data-driven studies.\nIn the past, I have designed machine learning models and real-time systems for mobile AR environment lighting estimation.\nI’m also interested in security and privacy issues associated with photorealism in AR.\nI’m fortunate to have conducted my research works in these areas under the guidance of Prof. Tian Guo alongside many wonderful collaborators, and I’m passionate to continue studying these problems in my Ph.D.",{"type":12,"tag":18,"props":45,"children":46},{},[47],{"type":22,"value":48},"Designing visual sensing systems has been a long-standing research topic for ubiquitous computing, mobile computing and computer vision.\nIn recent years, emerging AR applications raise new standards for environment sensing on mobile devices to satisfy the crave of increasing demand of photorealism and interactivity.\nLighting estimation, a task that aims to estimate omnidirectional lighting from limited environment observations, is at the key position of pursuing photorealistic and visually coherent rendering in AR.\nTraditionally, high-quality environment lighting is acquired using physical devices like light probes or 360° cameras.\nSuch physical approach has satisfied the needs of professional many users from filming industries and computer graphics researchers.\nHowever, the data acquisition process could be expensive and impractical for mobile AR applications.",{"type":12,"tag":18,"props":50,"children":51},{},[52],{"type":22,"value":53},"On a different vein, learning-based lighting estimation models have been adopted by the majority of AR frameworks in favor of their abilities to estimate environment lighting from single or multiple camera images.\nHowever, in complex real-world scenarios, such models often fail to adapt, as estimating 360° environment lighting from a low FoV camera image is a highly unconstrained task.\nThe deployment time difficulties challenges the traditional definition of lighting estimation, which aims to use image color and structure clues to estimate the environment lighting.\nMy past research has focused on leveraging user, device and environment dynamics to opportunistically generate lighting without interrupting user's application interaction.",{"type":12,"tag":18,"props":55,"children":56},{},[57,59,65],{"type":22,"value":58},"Check out my research project details ",{"type":12,"tag":25,"props":60,"children":62},{"href":61},"/project/",[63],{"type":22,"value":64},"here",{"type":22,"value":66},".",{"type":12,"tag":18,"props":68,"children":69},{},[70],{"type":12,"tag":71,"props":72,"children":73},"em",{},[74,76,82],{"type":22,"value":75},"I'm generally interested in collaborating with ubiquitous computing and machine learning projects related to AR/VR. If you share the same interests, ",{"type":12,"tag":25,"props":77,"children":79},{"href":78},"mailto:yzhao11@wpi.edu",[80],{"type":22,"value":81},"please shoot me an email",{"type":22,"value":83},"!",{"title":5,"searchDepth":85,"depth":85,"links":86},2,[],"markdown","content:research.md","content","research.md","md",1698084901426]