{"mdMeta":{"title":"写于22岁生日","date":"1530446400","category":"Life"},"content":"<p>2018年转眼过去一半了，这半年来发生了很多事。这篇文章开始与 2018年6月30日，今天晚上我做完了杂七杂八的许多事，修完了今天 USC 项目的 Bug，久违的让 WebStorm 升了个级，终于能坐下来思考一下自己了。</p>\n<p>前半年，也可以说是本学期吧。忙来忙外的做了很多事情，开学以来真的很忙很忙，校内有 论文 和 社团，校外还要找实习，找租房。更重要的是 Toefl 和 GRE 还要处分，但遗憾的是，这两项至今还没有出分，只能拖到下一个阶段了。</p>\n<h1>找实习</h1>\n<p>找实习大概是从 3月 开始找的，因为要准备 G，整个找实习的过程说实话都没有好好准备，现在让我去写一下自己的面经我感觉自己都写不出来。拿到的人生的第一份 offer 来自 <strong>猿辅导</strong>，当时非常高兴了，因为工资给了很多，感觉比很多厂子的正式员工都多。因为暑假才能入职，后来回到学校之后还在找别的厂子，思考了这段经历感慨很多。有时候在冥冥中觉得这是我原本的命运：高中被大家叫赵老师，高考崩了来了个二本师范，毕业后来一家互联网教育公司做开发，拿一份中等偏上的薪水，过着互联网人们亚健康的生活，年纪大一点之后或许被裁掉，或许做个小经理。剩下的人生仿佛在拿到 offer 那一刻就能看透了。</p>\n<p>但是我觉得这学期以来我遇到了人生思想层面的重要转折，就在于我了解到了 <strong>战神(God of War)</strong> 这款游戏。接触战神是从寒假看黑桐谷歌的视频开始的，当时认识到了这个猛男游戏，觉得很棒，就补完了剧情。我是个粗人，不仅是个粗人，还是个世俗的人。我非常喜欢战神的核心理念，<code>不屈服于力量和命运，哪怕你面对的是神，也要把他干倒。</code></p>\n<p>插句话，前些日子和好友交流，好友提到了一些把游戏当作艺术来欣赏的观点，并且给我讲了一些有这样执着追求的人的故事。说实话我是欣赏这种高尚的人的，但对我来说游戏的魅力在于他世俗的一面，每个人经过简单的学习都能了解到它的游戏操作，也能玩的津津乐道。我在游戏中更乐意与看到制作人传达的一种精神，并且也非常期待于通过游戏画面看到制作人在技术和艺术上的斗争与妥协，毕竟对于我这种天天在工程泥潭里挣扎的人来说，看到同行的执着也是鼓舞人心的。</p>\n<p>话说回来，战神这部作品给我带来的鼓舞是前所未有的，它甚至从根本上激发了我人生的斗志。而今年的战神4更是把内容刻画的深入。谈到了 <strong>斗志</strong> 与 <strong>战斗</strong>，这总是年轻人们津津乐道的话题。我拿了猿辅导的 offer 之后，后来又去面了美团点评，这大概是四月份的事情了，美团两面也过了，也拿了 offer。原本我以为春招就到此为止了，我也心满意足，后来又去面了狼厂，最后机缘巧合的也过了。这就让我突然觉得人生进入了另一条轨迹，我没有考到 985，也还只是个本科生，和北邮的同学一起面试最后也能拿 offer。</p>\n<p><strong>也许我们作为凡人，纵使心有神愿，身终无神力。自己编织命运之线可能做不到，但是给自己换一条还是可以的啊。可以说这是这次春招给我留下最大的印象了吧。</strong></p>\n<h1>论文</h1>\n<p>Research 这件事是从大二下学期开始的，现在回忆起来也真是艰苦，刚开始的时候根本什么都不懂，也没有设备没有技术基础，算法都是拿着同学的显卡跑的。以至于刚开始的时候，我都不知道一个深度学习模型该用什么框架去搭建。</p>\n<p>一路边摸黑边摸鱼走到了大三上学期，和本校的一个研究生合作出了一篇成果，不过因为我自己的工作做的不是很足，导师的意见还是让我继续再出一篇论文。继续摸黑摸到了本学期，查了一堆资料，跑了一堆数据，现在终于出了成果了。现在形成两篇论文肯定不成问题，五月份抹黑投的 ICMI 原本都撤稿了，结果还是进入了审核，甚至现在 review 尽然还给人一种能中的感觉。不管咋样吧，这是好事。继续努力，今年下半年估计摸摸鱼也能中个C类会加一篇SCI，加上之前中了的成果，申请学校是肯定够了。</p>\n<p>Research 做到现在我觉得变化最大的是 <strong>心态</strong>，其次是 <strong>思维方式</strong>。实验做不出来的时候真的是超级打击人，这个比 bug 改不出来可难受多了。其次思维方式的变化我觉得是会受益终身的，写过论文之后就会明白该如何科学的论证一个问题，如何进行实验，前因后果逻辑推断。逻辑这块真的太重要了，AI 正在快速落地，一些简单重复的工作很快就能被替代掉，反而优秀的逻辑未来会更吃香。</p>\n<h1>项目</h1>\n<p>这学期非常巧合的接了工大一个老师的项目，和 USC 建立了一些项目关系。这真的是意外的，其实是学院老师推荐过去的，接下了一个在线心理测试平台的开发工作，前中后台搞一套。到今天为止项目已经跟了三个月了吧，只有我一个人开发，和老师沟通也只是我自己。我感觉收获还是很多的，真正体会到了当代软件工程向前演进的感觉，写代码的时候仿佛捏泥人一样。</p>\n<p>整个项目经历了多次重构，为了让业务代码更清晰，构建了很多的基础代码，为了把组件化做好，抽象了很多东西，还把 Vue 全家桶用了个遍。能有这么一次经历确实还是很好。</p>\n<p>并且整个项目也非常需要沟通，不断的和甲方明确需求，检查测试。现在慢慢体会到，沟通的好能让自己少些很多代码。这个项目现在开发工作基本做完了，目前在打磨和修 bug，也混了一个 USC 的推荐信，很开心。</p>\n<h1>社团</h1>\n<p>本学期的社团其实做得挺不好的，因为实习面试没有组织几次活动。不过因为学校机房到位，和 Apple 方面算是正式建立了认证，并且在恒隆的 Apple Store 也办了活动，给孩子们买了同意的 t-shirt。总之慢慢的在走向正规，也选出了下一届的管理团队，我也算是退役了。今年的孩子们参加比赛的情况还不错，看着他们吵了半年的架，改了无数个需求和方案，从幼稚在走向成熟，还是蛮欣慰的。孩子们进了复赛，我还是挺看好他们的，努力努力进决赛应该不成问题，希望今年能比去年名次好。</p>\n<p>现在想起 Apple 给出的 iOS Club 理念，还挺感动的，果然人与人还是要信任，要合作，要共同进步。</p>\n<blockquote>\n<p>Surround yourself with the dreamers and the doers, the believers and the thinkers, but most of all, surround yourself with those who see greatness within you, even when you don't see it yourself.</p>\n</blockquote>\n<p>尤其是最后一句，深有感触了。</p>\n<h1>难以启齿的 TG</h1>\n<p>本学期考了两次 G，第一次考了 310，第二次不负众望的只考了 300，真是丢人了。掐着指头算算离申请的日子也不远了，现在 TG 还是都差个10分左右，真是很难受啊。很无奈把这两项又拖到了人生的这个阶段，只能抓紧时间努力吧。</p>\n<blockquote>\n<p>6月30日，写到这了，11:40了。我爸这个老直男在看世界杯，我要睡了。</p>\n</blockquote>\n<p>7月1日，早晨起来吃了点东西继续写。大学三年以来 TG 都是心头一道坎，之前一直想的要早点考完，结果一拖再拖到了现在。越往下学越感觉难受，像是泥潭一样。记得五月底考上一次 G 的时候，快交卷的时候简直心态炸裂，满脑子想的都是终于考完了，考成啥也不继续考了。结果 GG，考的还不如上次，回来的路上快气死了，结果还被某人骂了一顿，太难过了。原本打算去优衣库买一件暴雪合作的 t-shirt 的，结果考崩了灰头土脸的就回去了。想必这么弱的我，是没有办法为部落，为女王效忠的。</p>\n<p>站在现在看来，上半年已经过去了，TG 也到了决战场，先顶着实习的压力学吧，如果不行的话，开学之后就溜了，专心学 TG。</p>\n<h1>心烦的人际关系</h1>\n<p>我不止一次的对我自己说过 <strong>我讨厌人类</strong>。和人打交道可真是太烦了，每每想到这些，就会想起家里的事情，感情上的事情，这些对我来说仿佛永远都处理不好，永远都是问题。</p>\n<p>我其实并不了解我的父亲，但我明显的知道，我的人生道路和他是截然不同的。未来出去读书几年，必然是要让家里花很多钱的，希望这笔投资是成功的吧，毕竟对于父亲来说，这是超出他能力范围的。</p>\n<p>其实家里还有很多事，还有些人的脸色要看，还有期待给我安排些工作。我要变强，我不要被他们控制。</p>\n<p>感情上更是稀里糊涂。上个月见了她一面，聊了很多，觉得她还是很好的。但是日子过起来还是经常磕磕绊绊，可能过久了就是这样吧。对于感情这件事，我真的是嗦不粗话，真的是太笨了。</p>\n<h1>不知走向何方的人生</h1>\n<p>这学期从找实习开始是我人生中第一次职业生涯上的迷茫，现在我面前的是一条通往开发岗的不错的路，也许我现在毕业了就去工作，也能拿到不错的工资，在北京慢慢的安个家。但继续往上读书一定是能有更好的机会，不过肯定是需要家里支持更多的钱，我也要花更多的时间。现在时间对于我来说变得十分苛刻了，家人在一天天老去，我在一天天长大，越来越多的地方需要靠我支撑了。其实有时候觉得那些整天吃喝玩乐的年轻人的人生也真不错，相比于他们，我的中年危机似乎来得太快了。</p>\n<p>读书读到这个节点上，我发现我终究不是一个能心无旁骛的天天写代码的人，我的家庭不支持我这么做，而且我自己也总有别的想法。很多北漂的人都是抱着在北京奋斗几年挣些钱然后回家过日子的想法，说实话我是认可的，北京确实压力大，不适合人生活。但是我真的没有任何兴趣再回山西来，每次放假回来都能深刻的感受到这就是个小城市，身边的人和事都是一天天的按部就班的进行，就连商业街都不怎么变化。</p>\n<p>对于我来说，继续做开发岗可以说是乐观的，每天过着互联网公司的作息，写写 JavaScript，看看 V8 的 bytecode，人生也是蛮好的。但对我来说还想继续上升，一进入公司人生似乎就进入了减速带，上升的机会越来越少，能学到的新东西也越来越少。这学期以来努力的发了篇论文，慢慢的做了一些 Research，感觉人生的下一阶段也多了种可能。而且随着年龄变大，也在考虑身体的能力，这学期请了教练，做了针对性的锻炼，感觉身体素质还是不错的。纵使我非常喜欢写代码，但我也不希望把大量的人生浪费在日复一日的工作上，毕竟那是拿钱买命的事情。往下继续学的话，我觉得更多的是要面对自己，突破自己的心态，从竞赛和数学的阴霾里走出来。加油吧，一个人最大的敌人就是自己。</p>\n<p>我发现我是个对环境和文化比较敏感的人，我也正在人生的路上摸着黑寻找着，目前看来回山西不是一个好选择。其实从高中开始，就有想过以后去美国定居工作的想法，并且大学以来一直都是在践行着。这条路大概率是在赌，我不知道地球另一端的世界究竟对我来说是怎样的，出国的同学们每个人都有自己的看法。</p>\n<p>时至今日，对人生也有了很多新的认识和看法，很多小时候相信的媒体上的说辞，现在也看透了，不信了。究竟怎样才好，只有自己经历了才知道。现在人生对于我来说像是一场扑克牌，一步一步的把手上的牌囤好，再一步一步的把一手好牌打好，哪块都可能出错，总之人生还要继续，照着目前的方向继续前进吧。</p>\n<p>明天就要去北京了，4号入职，人生的新阶段就要开始了，祝我好运吧。</p>\n<blockquote>\n<p>如果你看到了 NETWORK FAILED，恭喜你，这是正常的。Roost 在我迁移后端的时候挂了，懒得修。</p>\n</blockquote>\n<blockquote>\n<p><strong>2018年10月6日更新</strong>：如果你没有看到，那也是正常的，因为我重构了前端。懒得加 Roost 了，后期再说吧。</p>\n</blockquote>\n"}